Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ32GS608.h
#define _IEC1_U2TXIE_POSITION                    0x0000000F
#define _IEC1_U2TXIE_MASK                        0x00008000
#define _IEC1_U2TXIE_LENGTH                      0x00000001

#define _IEC2_SPI2EIE_POSITION                   0x00000000
#define _IEC2_SPI2EIE_MASK                       0x00000001
#define _IEC2_SPI2EIE_LENGTH                     0x00000001

#define _IEC2_SPI2IE_POSITION                    0x00000001
#define _IEC2_SPI2IE_MASK                        0x00000002
#define _IEC2_SPI2IE_LENGTH                      0x00000001

#define _IEC2_IC3IE_POSITION                     0x00000005
#define _IEC2_IC3IE_MASK                         0x00000020
#define _IEC2_IC3IE_LENGTH                       0x00000001

#define _IEC2_IC4IE_POSITION                     0x00000006
#define _IEC2_IC4IE_MASK                         0x00000040
#define _IEC2_IC4IE_LENGTH                       0x00000001

#define _IEC3_SI2C2IE_POSITION                   0x00000001
#define _IEC3_SI2C2IE_MASK                       0x00000002
#define _IEC3_SI2C2IE_LENGTH                     0x00000001

#define _IEC3_MI2C2IE_POSITION                   0x00000002
#define _IEC3_MI2C2IE_MASK                       0x00000004
#define _IEC3_MI2C2IE_LENGTH                     0x00000001

#define _IEC3_INT3IE_POSITION                    0x00000005
#define _IEC3_INT3IE_MASK                        0x00000020
#define _IEC3_INT3IE_LENGTH                      0x00000001

#define _IEC3_INT4IE_POSITION                    0x00000006
#define _IEC3_INT4IE_MASK                        0x00000040
#define _IEC3_INT4IE_LENGTH                      0x00000001

#define _IEC3_PSEMIE_POSITION                    0x00000009
#define _IEC3_PSEMIE_MASK                        0x00000200
#define _IEC3_PSEMIE_LENGTH                      0x00000001

#define _IEC3_QEI1IE_POSITION                    0x0000000A
#define _IEC3_QEI1IE_MASK                        0x00000400
#define _IEC3_QEI1IE_LENGTH                      0x00000001

#define _IEC4_U1EIE_POSITION                     0x00000001
#define _IEC4_U1EIE_MASK                         0x00000002
#define _IEC4_U1EIE_LENGTH                       0x00000001

#define _IEC4_U2EIE_POSITION                     0x00000002
#define _IEC4_U2EIE_MASK                         0x00000004
#define _IEC4_U2EIE_LENGTH                       0x00000001

#define _IEC4_PSESMIE_POSITION                   0x00000009
#define _IEC4_PSESMIE_MASK                       0x00000200
#define _IEC4_PSESMIE_LENGTH                     0x00000001

#define _IEC4_QEI2IE_POSITION                    0x0000000B
#define _IEC4_QEI2IE_MASK                        0x00000800
#define _IEC4_QEI2IE_LENGTH                      0x00000001

#define _IEC5_ADCP8IE_POSITION                   0x00000001
#define _IEC5_ADCP8IE_MASK                       0x00000002
#define _IEC5_ADCP8IE_LENGTH                     0x00000001

#define _IEC5_ADCP12IE_POSITION                  0x0000000D
#define _IEC5_ADCP12IE_MASK                      0x00002000
#define _IEC5_ADCP12IE_LENGTH                    0x00000001

#define _IEC5_PWM1IE_POSITION                    0x0000000E
#define _IEC5_PWM1IE_MASK                        0x00004000
#define _IEC5_PWM1IE_LENGTH                      0x00000001

#define _IEC5_PWM2IE_POSITION                    0x0000000F
#define _IEC5_PWM2IE_MASK                        0x00008000
#define _IEC5_PWM2IE_LENGTH                      0x00000001

#define _IEC6_PWM3IE_POSITION                    0x00000000
#define _IEC6_PWM3IE_MASK                        0x00000001
#define _IEC6_PWM3IE_LENGTH                      0x00000001

#define _IEC6_PWM4IE_POSITION                    0x00000001
#define _IEC6_PWM4IE_MASK                        0x00000002
#define _IEC6_PWM4IE_LENGTH                      0x00000001

#define _IEC6_PWM5IE_POSITION                    0x00000002
#define _IEC6_PWM5IE_MASK                        0x00000004
#define _IEC6_PWM5IE_LENGTH                      0x00000001

#define _IEC6_PWM6IE_POSITION                    0x00000003
#define _IEC6_PWM6IE_MASK                        0x00000008
#define _IEC6_PWM6IE_LENGTH                      0x00000001

#define _IEC6_PWM7IE_POSITION                    0x00000004
#define _IEC6_PWM7IE_MASK                        0x00000010
#define _IEC6_PWM7IE_LENGTH                      0x00000001

#define _IEC6_PWM8IE_POSITION                    0x00000005
#define _IEC6_PWM8IE_MASK                        0x00000020
#define _IEC6_PWM8IE_LENGTH                      0x00000001

#define _IEC6_AC2IE_POSITION                     0x00000007
#define _IEC6_AC2IE_MASK                         0x00000080
#define _IEC6_AC2IE_LENGTH                       0x00000001

#define _IEC6_AC3IE_POSITION                     0x00000008
#define _IEC6_AC3IE_MASK                         0x00000100
#define _IEC6_AC3IE_LENGTH                       0x00000001

#define _IEC6_AC4IE_POSITION                     0x00000009
#define _IEC6_AC4IE_MASK                         0x00000200
#define _IEC6_AC4IE_LENGTH                       0x00000001

#define _IEC6_ADCP0IE_POSITION                   0x0000000E
#define _IEC6_ADCP0IE_MASK                       0x00004000
#define _IEC6_ADCP0IE_LENGTH                     0x00000001

#define _IEC6_ADCP1IE_POSITION                   0x0000000F
#define _IEC6_ADCP1IE_MASK                       0x00008000
#define _IEC6_ADCP1IE_LENGTH                     0x00000001

#define _IEC7_ADCP2IE_POSITION                   0x00000000
#define _IEC7_ADCP2IE_MASK                       0x00000001
#define _IEC7_ADCP2IE_LENGTH                     0x00000001

#define _IEC7_ADCP3IE_POSITION                   0x00000001
#define _IEC7_ADCP3IE_MASK                       0x00000002
#define _IEC7_ADCP3IE_LENGTH                     0x00000001

#define _IEC7_ADCP4IE_POSITION                   0x00000002
#define _IEC7_ADCP4IE_MASK                       0x00000004
#define _IEC7_ADCP4IE_LENGTH                     0x00000001

#define _IEC7_ADCP5IE_POSITION                   0x00000003
#define _IEC7_ADCP5IE_MASK                       0x00000008
#define _IEC7_ADCP5IE_LENGTH                     0x00000001

#define _IEC7_ADCP6IE_POSITION                   0x00000004
#define _IEC7_ADCP6IE_MASK                       0x00000010
#define _IEC7_ADCP6IE_LENGTH                     0x00000001

#define _IEC7_ADCP7IE_POSITION                   0x00000005
#define _IEC7_ADCP7IE_MASK                       0x00000020
#define _IEC7_ADCP7IE_LENGTH                     0x00000001

#define _IPC0_INT0IP_POSITION                    0x00000000
#define _IPC0_INT0IP_MASK                        0x00000007
#define _IPC0_INT0IP_LENGTH                      0x00000003

#define _IPC0_IC1IP_POSITION                     0x00000004
#define _IPC0_IC1IP_MASK                         0x00000070
#define _IPC0_IC1IP_LENGTH                       0x00000003

#define _IPC0_OC1IP_POSITION                     0x00000008
#define _IPC0_OC1IP_MASK                         0x00000700
#define _IPC0_OC1IP_LENGTH                       0x00000003

#define _IPC0_T1IP_POSITION                      0x0000000C
#define _IPC0_T1IP_MASK                          0x00007000
#define _IPC0_T1IP_LENGTH                        0x00000003

#define _IPC0_INT0IP0_POSITION                   0x00000000
#define _IPC0_INT0IP0_MASK                       0x00000001
#define _IPC0_INT0IP0_LENGTH                     0x00000001

#define _IPC0_INT0IP1_POSITION                   0x00000001
#define _IPC0_INT0IP1_MASK                       0x00000002
#define _IPC0_INT0IP1_LENGTH                     0x00000001

